==================
Expression-1 `*`
==================
test = name*
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (unary_expression
          (expression
            (id)))))))

==================
Expression-2 `+`
==================
test = name+
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (unary_expression
          (expression
            (id)))))))

==================
Expression-3 `?`
==================
test = name?
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (unary_expression
          (expression
            (id)))))))

==================
Expression-4 `~`
==================
test = a ~ b
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (binary_expression
          (expression
            (id))
          (WHITESPACE)
          (WHITESPACE)
          (expression
            (id)))))))

==================
Expression-5 ` `
==================
test = a b
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (binary_expression
          (expression
            (id))
          (expression
            (id)))))))


==================
Expression-6 `|`
==================
test = a | b
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (binary_expression
          (expression
            (id))
          (WHITESPACE)
          (WHITESPACE)
          (expression
            (id)))))))