==================
Expression-1.1 `?`
==================
test = name?
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (unary_suffix
          (expression
            (id)))))))

==================
Expression-1.2 `+`
==================
test = name+
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (unary_suffix
          (expression
            (id)))))))

==================
Expression-1.3 `*`
==================
test = name*
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (unary_suffix
          (expression
            (id)))))))

==================
Expression-2.1 `^`
==================
test = ^name
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (unary_prefix
          (expression
            (id)))))))

==================
Expression-4.1 `~`
==================
test = a ~ b
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (binary_expression
          (expression
            (id))
          (WHITESPACE)
          (WHITESPACE)
          (expression
            (id)))))))

==================
Expression-4.2 ` `
==================
test = a  b
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (binary_expression
          (expression
            (id))
          (WHITESPACE)
          (expression
            (id)))))))


==================
Expression-4.3 `|`
==================
test = a | b
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (binary_expression
          (expression
            (id))
          (WHITESPACE)
          (WHITESPACE)
          (expression
            (id)))))))

==================
Expression-4.4 `#`
==================
test = a #A | b #B
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (binary_expression
          (expression
            (binary_expression
              (expression
                (id))
              (WHITESPACE)
              (variant_tag
                (id))))
          (WHITESPACE)
          (WHITESPACE)
          (expression
            (binary_expression
              (expression
                (id))
              (WHITESPACE)
              (variant_tag
                (id)))))))))
