==================
Expression-1.1 `number`
==================
test = 0
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (unsigned)))))

==================
Expression-1.1 `number`
==================
test = 10
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (unsigned)))))

==================
Expression-2.1 `string`
==================
test = "s"
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (string)))))

==================
Expression-2.2 `string`
==================
test = "\s"
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (string)))))

==================
Expression-3.1 `set`
==================
test = \p{XID_Start}
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (regex_set)))))

==================
Expression-4.1 `range`
==================
test = [0]
------------------

(program)

==================
Expression-4.2 `range`
==================
test = [0-1]
------------------

(program)

==================
Expression-4.3 `range`
==================
test = [0-1]
------------------

(program)

==================
Expression-4.4 `range`
==================
test = [_0-9a-zA-Z]
------------------

(program)

==================
Expression-5.1 `regex`
==================
test = /i/i
------------------

(program)
