==================
Expression-1.1 `?`
==================
test = name?
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (UnarySuffix
          (expression
            (id)))))))

==================
Expression-1.2 `+`
==================
test = name+
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (UnarySuffix
          (expression
            (id)))))))

==================
Expression-1.3 `*`
==================
test = name*
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (UnarySuffix
          (expression
            (id)))))))

==================
Expression-2.1 `^`
==================
test = ^name
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (UnaryPrefix
          (expression
            (id)))))))

==================
Expression-3.1 `~`
==================
test = a ~ b
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (expression
          (id))
        (WHITESPACE)
        (WHITESPACE)
        (expression
          (id))))))

==================
Expression-3.2 ` `
==================
test = a  b
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (id))))
  (WHITESPACE)
  (WHITESPACE)
  (ERROR
    (id)))

==================
Expression-4.1 `|`
==================
test = a | b
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (WHITESPACE)
      (expression
        (variant_tag
          (expression
            (id)))
        (WHITESPACE)
        (WHITESPACE)
        (variant_tag
          (expression
            (id)))))))

==================
Expression-4.2 `#`
==================
test = a #A
------------------

(program
  (ERROR
    (id)
    (WHITESPACE)
    (eq)
    (WHITESPACE)
    (variant_tag
      (expression
        (id))
      (WHITESPACE)
      (id))))

==================
Expression-4.3 `#`
==================
test =
	| a #A
	| b
------------------

(program
  (statement
    (assign_statement
      (id)
      (WHITESPACE)
      (eq)
      (NEWLINE)
      (WHITESPACE)
      (WHITESPACE)
      (WHITESPACE)
      (expression
        (variant_tag
          (expression
            (id))
          (WHITESPACE)
          (id))
        (NEWLINE)
        (WHITESPACE)
        (WHITESPACE)
        (WHITESPACE)
        (variant_tag
          (expression
            (id)))))))
