==================
Expression-1.1 `number`
==================
test = 0
------------------

(program)

==================
Expression-1.1 `number`
==================
test = 10
------------------

(program)

==================
Expression-2.1 `string`
==================
test = "s"
------------------

(program)

==================
Expression-2.2 `string`
==================
test = "\s"
------------------

(program)

==================
Expression-3.1 `range`
==================
test = [0]
------------------

(program)

==================
Expression-3.2 `range`
==================
test = [0-1]
------------------

(program)

==================
Expression-4.1 `regex`
==================
test = /i/i
------------------

(program)
